app/views/topics/show.html.erb

  <div class="row">
  <% @topic.bookmarks.each do |bookmark| %>
---
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."topic_id" = ?  [["topic_id", 1]]