app/controllers/bookmarks_controller.rb

  def show
     @bookmark = Bookmark.find(params[:id])
---
SELECT  "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    @bookmark = Bookmark.find(params[:id])
---
SELECT  "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = ? LIMIT 1  [["id", 1]]

  def create
  @topic = Topic.find(params[:topic_id])
  @bookmark = @topic.bookmarks.new(bookmark_params)
  @bookmark.user = current_user

    if @bookmark.save
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "bookmarks" ("url", "topic_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["url", "Orange"], ["topic_id", 4], ["user_id", 1], ["created_at", "2019-03-22 13:58:41.659154"], ["updated_at", "2019-03-22 13:58:41.659154"]]

  def destroy

     @bookmark = Bookmark.find(params[:id])


     if @bookmark.destroy
---
SELECT  "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "bookmarks" WHERE "bookmarks"."id" = ?  [["id", 1]]