app/controllers/likes_controller.rb

def create
     @bookmark = Bookmark.find(params[:bookmark_id])
     @topic = @bookmark.topic
     like = current_user.likes.build(bookmark: @bookmark)

     authorize like

     if like.save
---
SELECT  "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "likes" ("bookmark_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["bookmark_id", 1], ["user_id", 1], ["created_at", "2019-03-22 12:18:01.060645"], ["updated_at", "2019-03-22 12:18:01.060645"]]

   def destroy
     @bookmark = Bookmark.find(params[:bookmark_id])
     @topic = @bookmark.topic
     like = current_user.likes.find(params[:id])
     authorize like

     if like.destroy
---
SELECT  "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."id" = ? LIMIT 1  [["user_id", 1], ["id", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 1]]