app/controllers/topics_controller.rb

    def create
      @topic = Topic.new(topic_params)
      @topic.user = current_user
      if @topic.save
---
INSERT INTO "topics" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Apples"], ["created_at", "2019-03-05 17:24:20.040857"], ["updated_at", "2019-03-05 17:24:20.040857"]]